tap "mongodb/brew"
brew "awscli"
brew "bat"
brew "bottom"
brew "clamav"
brew "cloc"
brew "dnsmasq"
brew "exiftool"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libmemcached"
brew "mysql", restart_service: :changed
brew "mysql-client@8.0"
brew "ncdu"
brew "nginx", restart_service: :changed
brew "pandoc"
brew "php", link: false
brew "php@8.3", link: true
brew "php@8.4"
brew "pkgconf"
brew "poppler"
brew "potrace"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "watchman"
brew "wget"
brew "yarn"
brew "yq"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "mongodb/brew/mongodb-community"
cask "font-jetbrains-mono-nerd-font"
cask "macdown-3000"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "calebporzio.better-phpunit"
vscode "celianriboulet.webvalidator"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gnomeria.vscode-jumpy"
vscode "hbenl.vscode-mocha-test-adapter"
vscode "hbenl.vscode-test-explorer"
vscode "irongeek.vscode-env"
vscode "jebbs.markdown-extended"
vscode "jorgecortesdev.web-development-essentials-extension-pack"
vscode "jorgeserrano.vscode-csharp-snippets"
vscode "junstyle.php-cs-fixer"
vscode "kleber-swf.unity-code-snippets"
vscode "kreativ-software.csharpextensions"
vscode "mechatroner.rainbow-csv"
vscode "mehedidracula.php-namespace-resolver"
vscode "mikestead.dotenv"
vscode "mronline.react-import-sorter"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.test-adapter-converter"
vscode "naumovs.color-highlight"
vscode "onecentlin.laravel-blade"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sdras.vue-vscode-snippets"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "thomascsd.vscode-readme-pattern"
vscode "tobermory.es6-string-html"
vscode "tobiah.unity-tools"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tonka3000.raycast"
vscode "vue.volar"
vscode "wmaurer.vscode-jumpy"
vscode "wware.snippet-creator"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
